#ifndef parameters_h
#define parameters_h

// все параметры представлены в десятичной системе счисления

// коэффициент "a" в уравнении эллиптической кривой в канонической форме
#define aPar "87789765485885808793369751294406841171614589925193456909855962166505018127157"

// коэффициент "b" в уравнении эллиптической кривой в канонической форме
#define bPar "18713751737015403763890503457318596560459867796169830279162511461744901002515"

// модуль "p" эллиптической кривой
#define pPar "115792089237316195423570985008687907853269984665640564039457584007913129639319"

// Значение, вычисленное дополнительно на основе параметров в Wolfram Mathematica

#define thetaPar "454069018412434321972378083527459607666454479745512801572100703902391945898"

// порядок "q" циклической подгруппы группы точек эллиптической кривой
#define qPar "28948022309329048855892746252171976963338560298092253442512153408785530358887"

// координата "x" точки P на эллиптической кривой в канонической форме
#define xPar "65987350182584560790308640619586834712105545126269759365406768962453298326056"

// координатa "y" точки Р на эллиптической кривой в канонической форме
#define yPar "22855189202984962870421402504110399293152235382908105741749987405721320435292"
#endif
